T1rs_202510_mesh_RD_smoothSurf_backup/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
		nSweeps         2;
    }
	pFinal 
    {
		$p;
        relTol		 0;
    }

    Phi
    {
        $p;
    }

    U
    {
	//solver          smoothSolver;	//???
	//smoother        GaussSeidel;    //???
	solver          PBiCGStab;  	//from PMF
        preconditioner  DILU;		//from PMF	
        tolerance       1e-6;
        relTol          0.1;
	//nSweeps         1;		//???
    }
	UFinal
    {
		$U;
        relTol		 0;
    }
    "(k|omega|nuTilda).*"
    {
	//solver          smoothSolver;	//???
	//smoother        GaussSeidel;	//???
        solver          PBiCGStab; 	//from PMF 
        preconditioner  DILU;		//from PMF 
        tolerance       1e-6;
        relTol          0.1;
	//nSweeps         1;		//???
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
	consistent no; 	

    residualControl
    {
        p               1e-3;
        U               1e-6;
        k               1e-6;
        omega           1e-6;
        nuTilda         1e-4;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 50;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.5;
        k               0.5;
        omega           0.5;
		nuTilda         0.5;
    }
}


// ************************************************************************* //
