T1rs_202510_mesh_RD_smoothSurf_backup/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh 1;
snap            1;
addLayers       0;

xmin -3;
xmax  13;
ymin -0.305;
ymax  2;
zmin -2.2;
zmax  2.2;

geometry
{
    T1rs_M.stl
    {
        type triSurfaceMesh;
        file "T1rs_M.stl";
		name T1rs;

    }

    refinementBox_0
    {
        type searchableBox;
        min (-2.5 $ymin -1.4);
        max ($xmax 1.8 1.4);
    }
	
    refinementBox_1
    {
        type searchableBox;
        min (-2.1 $ymin -0.8);
        max (8  1.3 0.8);
    }

    refinementBox_2
    {
        type searchableBox;
        min (-1.9 $ymin -0.5);
        max (6 1.1 0.5);
    }

	refinementBox_3
    {
        type searchableBox;
        min (-1.4 $ymin -0.3);
        max (3.5 1 0.3);
    }
	/*
	refinementBox_4
    {
        type searchableBox;
        min (-1 $ymin -0.25);
        max (1 0.7 0.25);
    }
    */
	/*
	refinementBox_5
    {
        type searchableBox;
        min (-0.6 -0.1 -0.06);
        max (0.2 0.45 0.06);
    }
	*/
	/*
	refinementBox_5
    {
        type searchableBox;
        min (-0.6 0.1 -0.07);
        max (-0.2 0.45 0.07);
    }
	*/
};

castellatedMeshControls
{

    maxLocalCells 1200000;

    maxGlobalCells 40000000;

    minRefinementCells 10;

    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 3;

    features
    (
        {
        file "T1rs_M.eMesh";		//check on the stl file name
        level 9;
        }
    );

    refinementSurfaces
    {
		T1rs
        {
        level (8 9);
		patchInfo { type wall; }
		}
	
    }

    // Resolve sharp angles
    resolveFeatureAngle 20;

    refinementRegions
    {
	
        refinementBox_0
        {
            mode    inside;
            levels ((1E15 1));
        }
		
        refinementBox_1
        {
            mode    inside;
            levels ((1E15 2));
        }

        refinementBox_2
        {
            mode    inside;
            levels ((1E15 3));
        }

		
        refinementBox_3
        {
            mode    inside;
            levels ((1E15 4));
        }
		/*
		refinementBox_4
        {
            mode    inside;
            levels ((1E15 6));
        }
		
		refinementBox_5
        {
            mode    inside;
            levels ((1E15 7));
        }
		*/
    }

    // The section reachable from the insidePoint is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    insidePoint (0 0.001 0.301);

    allowFreeStandingZoneFaces false;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 8;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 4;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 100;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 8;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap true;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap false;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
		
        debug 1;
		//detectFeatures true;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        NACA0012_3d_mm
        {
            nSurfaceLayers 5;
        }
    }

    // Expansion factor for layer mesh
    expansionRatio 1.15;

    finalLayerThickness 0.8;

    minThickness 0.00001;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;

    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 90;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    slipFeatureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 3;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 3;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
    minMedianAxisAngle 90;


    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;
}


// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"
}

// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
